# Kaggle Pandas

In [ ]:
museum_data = pd.read_csv(museum_filepath,index_col="Date", parse_dates=True)

#### Creating a Dataframe

In [17]:
import pandas as pd

fruit = pd.DataFrame({'Apples': [35,41,34], 'Bananas':[21,34,32]}, 
                           index= ['2017 Sales','2018 Sales','2019 Sales'])
fruit

            Apples  Bananas
2017 Sales      35       21
2018 Sales      41       34
2019 Sales      34       32

**Creating a Series**

In [4]:
quantities = ['4 cups', '1 cup', '2 large', '1 can']
items = ['Flour', 'Milk', 'Eggs', 'Spam']
recipe = pd.Series(quantities, index=items, name='Dinner')
recipe

Flour     4 cups
Milk       1 cup
Eggs     2 large
Spam       1 can
Name: Dinner, dtype: object

In [ ]:
reviews = pd.read_csv('../input/wine-reviews/winemag-data_first150k.csv', index_col=0 )
#SET THE NUMBER OF ENTRIES DISPLAYED
pd.set_option("display.max_rows", 5)

Choosing the exact cell

In [12]:
#choosing the first cell of description column
first_description = fruit_sales.Bananas.iloc[0]
#otherways
fruit_sales.Bananas[0]
#fruit_sales.loc[0,'Bananas']

#choosing first row
first_row = fruit_sales.iloc[0]
first_row

#choosing the first temn values
first_descriptions = fruit_sales.iloc[:10]

#Choosing multiple indices
indice= [1,2,3,5,8]
sample_reviews = reviews.loc[indice]

# choosing specific indices and columns
indice= [0,1,10,100]
cols= ['country','province','region_1','region_2']
df = reviews.loc[indice,cols]

#select first 100 records (bulk); Nte an index column was not generated or challenge to generate
cols = ['country', 'variety']
df = reviews.loc[:99, cols]

#select on column basis
italian_wines = reviews[reviews.country=='Italy']

Apples     35
Bananas    21
Name: 2017 Sales, dtype: int64

Create a DataFrame `top_oceania_wines` containing all reviews with at least 95 points (out of 100) for wines from Australia or New Zealand

In [ ]:
top_oceania_wines = reviews.query('country in ["Australia","New Zealand"] and points >= 95')


#generic way
top_oceania_wines = reviews.loc[
    (reviews.country.isin(['Australia', 'New Zealand']))
    & (reviews.points >= 95)
]

### Summary Functions

In [ ]:
reviews.points.describe()
reviews.taster_name.unique()
reviews.taster_name.value_counts()

In [ ]:
M

### Map functions/applications

Suppose we want to to remean a set of values. How would we do it?

In [18]:
fruit_banana_mean = fruit.Bananas.mean()
fruit.Bananas.map(lambda p: p - fruit_banana_mean)

#Longway Shit
def remean_points(row):
    row.points = row.points - review_points_mean
    return row

#reviews.apply(remean_points, axis='columns')

2017 Sales   -8.0
2018 Sales    5.0
2019 Sales    3.0
Name: Bananas, dtype: float64

In [19]:
fruit.Bananas.apply(lambda p: p - fruit.Bananas.mean())

2017 Sales   -8.0
2018 Sales    5.0
2019 Sales    3.0
Name: Bananas, dtype: float64

You can combine columns directly with ease

In [20]:
fruit.Bananas + fruit.Apples

2017 Sales    56
2018 Sales    75
2019 Sales    66
dtype: int64

 ### Data Exploration
 
Who are the most common wine reviewers in the dataset? Create a `Series` whose index is the `taster_twitter_handle` category from the dataset, and whose values count how many reviews each person wrote.

In [21]:

reviews_written = reviews.groupby('taster_twitter_handle').size()

#or

reviews_written = reviews.groupby('taster_twitter_handle').taster_twitter_handle.count()

SyntaxError: invalid syntax (<ipython-input-21-08a98a4728fe>, line 3)

**Exercise** Group by Price and find the max points and have that sorted

In [ ]:
best_rating_per_price = reviews.groupby('price')['points'].max().sort_index()

**Exercise**  Create a dataframe that is grouped by variety and get both the max and min values fro price

In [ ]:
price_extremes = reviews.groupby('variety').price.agg([min, max])

**Exercises** Sort the values by two columns!

In [ ]:
sorted_varieties = price_extremes.sort_values(by=['min', 'max'], ascending=False)

**Exercise** Find the average mean for each reviewer, where index is person name

In [ ]:
reviewer_mean_ratings = reviews.groupby('taster_name').points.mean()

**Exercise** Multi-index and get the number of wines and descending order

In [ ]:
country_variety_counts = reviews.groupby(['country','variety']).size().sort_values(ascending=False)

### Duplicating and manipulating Dataframes

**Exercise** Duplicate a dataframe but change some column names

In [ ]:
renamed = reviews.rename(columns=dict(region_1='region', region_2='locale'))

In [ ]:
# reindex with name wines
reindexed = reviews.rename_axis('wines', axis='rows')

**Exercise** Combine two dataframes vertically CONCAT

In [ ]:
combined_products = pd.concat([gaming_products, movie_products])

**Exercise** Combine columns based on common MeetID

In [ ]:
powerlifting_combined = powerlifting_meets.set_index("MeetID").join(powerlifting_competitors.set_index("MeetID"))

### Pivot Table!

It is recommended to do a groupby function first **IF** you are looking for a count. If there are duplicate values on index. The pivot table takes the average of values grouped together

In [43]:
df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two',
...                            'two'],
...                    'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
...                    'baz': [1, 2, 3, 4, 5, 6],
...                    'zoo': ['x', 'y', 'z', 'q', 'w', 't']})

df

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [44]:
#We choose the index and choose the column to have values and then the values is content
print(df.pivot(index='foo', columns='bar', values='baz'))

#You can create a second layer
df.pivot(index='foo', columns='bar', values=['baz', 'zoo'])

bar  A  B  C
foo
one  1  2  3
two  4  5  6

    baz       zoo
bar   A  B  C   A  B  C
foo
one   1  2  3   x  y  z
two   4  5  6   q  w  t

The groupby function is done automatically with average of values

In [45]:
df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two',
...                            'two'],
...                    'bar': ['A', 'A', 'C', 'A', 'B', 'C'],
...                    'baz': [1, 2, 3, 4, 5, 6],
...                    'zoo': ['x', 'y', 'z', 'q', 'w', 't']})


print(df)
df.pivot_table(index='foo', columns='bar', values='baz',fill_value=0)

   foo bar  baz zoo
0  one   A    1   x
1  one   A    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

bar    A  B  C
foo
one  1.5  0  3
two  4.0  5  6

Alternative is to use the group by function to get the desired option when grouping

In [38]:
rf=df.groupby(['foo', 'bar'])['baz'].sum().reset_index()

rf.pivot_table(index='foo', columns='bar', values='baz', fill_value=0)

bar  A  B  C
foo
one  3  0  3
two  4  5  6

In [36]:
df.groupby(['foo', 'bar'])['baz'].sum().reset_index()

   foo bar  baz
0  one   A    3
1  one   C    3
2  two   A    4
3  two   B    5
4  two   C    6